README.org
** dtrt-indent
A minor mode that guesses the indentation offset originally used for creating
source code files and transparently adjusts the corresponding settings in Emacs,
making it more convenient to edit foreign files.
https://github.com/jscheid/dtrt-indent
** emacs-org-transform-tree-table
Transform an org-mode outline and its properties to a table format (org-table,
CSV)
https://github.com/jplindstrom/emacs-org-transform-tree-table
** indent-control
Generic control the indentation level for each mode.
https://github.com/jcs-elpa/indent-control
** emmet-mode
Unofficial Emmet's support for emacs
https://github.com/emacsmirror/emmet-mode
* config emacs by purpose
** edit org files to become pdf files
** write literate configuration in org mode then tangle to the respective config files
** take notes in org mode from books, videos, sites, etc.
** organize life with org mode
*** use the agenda
*** have specific TODOs for important stuff
**** bills due dates
**** medicine depleting dates
**** university due dates
**** recurring tasks
*** capture
**** thoughts
**** dreams
**** TODOs
** develop a personal knowledge management system (PKMS)
*** a reference place for the things I learn
** programming environment for different languages and technologies
*** gdscript
*** python
*** web / mobile apps
**** html
**** css
**** javascript
**** vue
**** svelte
**** nativescript
**** webassembly
*** rust
*** C/C++
*** docker
*** shell
**** zsh
**** fish
* configs TODOs
** TODO + hydras
*** TODO + manipulate windows
**** TODO splitting
**** TODO switching
**** TODO change buffer
**** TODO closing
**** TODO resizing
*** TODO + selecting text
** TODO + changes to org mode
*** DONE add org roam
*** TODO add headers/bullets on the line the cursor is on
not after the last item of the current sub-tree
*** TODO change the bullet point symbol used
*** TODO change the faces for the org-bullets
*** TODO change color of headers
*** TODO hide synthax markers in org mode
*** TODO start org files folded
*** TODO change the ... when a header is folded
*** TODO configure org agenda and org super agenda
** TODO + add adtional language support that does not have a module for it
*** TODO vue
*** TODO svelte
** TODO + UI improvements
*** TODO + the tabs are showing on the completion list
**** TODO either hide that or make it show the name of the key pressed before (category)
*** TODO get the minimap working
*** TODO show all tabs, not just tabs of files of same extension
or show tabs for the groups of buffers present
*** TODO get the scrollbar on the right back
*** TODO change the which key position to the middle of the screen or on the vertical
I am using vertico now so it may not be which key anymore

which key github page / documentation
https://github.com/justbur/emacs-which-key#popup-type-options
*** TODO config the dashboard
*** TODO configure org capture templates
*** TODO how to fix the "us international with dead keys" problem on Emacs
maybe this can solve the issue:
https://www.emacswiki.org/emacs/DeadKeys

another resource trying to fix by having 2 keyboard layouts:
https://askubuntu.com/questions/364292/dead-keys-in-emacs-with-ibus
*** TODO change how the cursor traverses lines that are wraped
*** TODO ? find a way to show the other options on which key
preferably bind =C-h= and =C-l=, or =C-j= and =C-k= to go forwards and backwards
on the list

** TODO + text formatting / styling / completion
*** TODO show synthax markers when inside the word that is surounded by them
the name of the package is =org-reveal=
*** TODO find out if changing the rendering of a word in general can work like org-reveal
for examble: changing lambda for λ

but when the cursor is at the symbol the rendering changes back to the word lambda

the original idea (as I know of) of having some words change to symbols comes
from a distrotube video: https://www.youtube.com/watch?v=5iCjhdCUuLg&t=6s
*** TODO change fundamental mode to org mode?
*** TODO ? how to make emacs highlight given words with different colors no metter what mode it is in
*** TODO change elisp formatting rules
make end of parenthesis line up with the oppening parenthesis on its own line
*** TODO add code completion on emacs lisp blocks (or any org-babel block really)
*** TODO configure snippets
*** TODO configure grammar with that proram I found
look on email for grammar, synthax or spelling

https://languagetool.org/

https://github.com/mhayashi1120/Emacs-langtool
** TODO + keybindings
*** TODO add documentation to this config about every key mapping in Emacs and Doom Emacs
making the distinction of the keybinding comming from Emacs or Doom Emacs,
including which package overrides that keybinding, also document if the
keybinding is changed by me
* Config files
** init.el
#+begin_src emacs-lisp :tangle ./init.el

#+end_src
*** introduction
This file controls *what Doom modules are enabled* and *what order they load in*.
*Remember to run =doom sync= after modifying it!*

NOTE Press =SPC h d h= (or =C-h d h= for non-vim users) to access Doom's
documentation. There you'll find a "Module Index" link where you'll find a
comprehensive list of Doom's modules and what flags they support.

NOTE Move your cursor over a module's name (or its flags) and press =K= (or =C-c
c k= for non-vim users) to view its documentation. This works on flags as well
(those symbols that start with a plus).

Alternatively, press 'gd' (or 'C-c c d') on a module to browse its
directory (for easy access to its source code).

*** doom block start
#+begin_src emacs-lisp :tangle ./init.el
;;; init.el -*- lexical-binding: t; -*-
(doom!
#+end_src
*** input
+ [[file:../modules/input/chinese/README.org][chinese]] - TODO
+ [[file:../modules/input/japanese/README.org][japanese]] - TODO
+ [[file:../modules/input/layout/README.org][layout]] =+azerty +bepo= - TODO

#+begin_src emacs-lisp :tangle ./init.el
       :input
       ;;chinese

       ;;japanese

       ;;(layout            ; auie,ctsrnm is the superior home row
       ;; +azerty
       ;; +bepo
       ;; )
#+end_src
*** completion
Modules that provide new interfaces or frameworks for completion, including code
completion.

+ [[file:../modules/completion/company/README.org][company]] =+childframe +tng= - The ultimate code completion backend
+ helm =+fuzzy +childframe= - *Another* search engine for love and life
+ ido - The /other/ *other* search engine for love and life
+ [[file:../modules/completion/ivy/README.org][ivy]] =+fuzzy +prescient +childframe +icons= - /The/ search engine for love and
  life
+ [[file:../modules/completion/vertico/README.org][vertico]] =+icons= - The search engine of the future

#+begin_src emacs-lisp :tangle ./init.el
       :completion
       (company           ; the ultimate code completion backend
       ;; +childframe
       ;; +tng
        )

       ;;(helm              ; the *other* search engine for love and life
       ;; +fuzzy
       ;; +childframe
       ;; )

       ;;ido               ; the other *other* search engine...

       ;;(ivy              ; a search engine for love and life
       ;; +fuzzy
       ;; +childframe
       ;; +prescient
       ;; +icons
       ;;)

       (vertico           ; the search engine of the future
        +icons
        )

#+end_src
*** ui
Aesthetic modules that affect the Emacs interface or user experience.

+ [[file:../modules/ui/deft/README.org][deft]] - TODO
+ [[file:../modules/ui/doom/README.org][doom]] - TODO
+ [[file:../modules/ui/doom-dashboard/README.org][doom-dashboard]] - TODO
+ [[file:../modules/ui/doom-quit/README.org][doom-quit]] - TODO
+ [[file:../modules/ui/emoji/README.org][emoji]] =+ascii +github +unicode= - Adds emoji support to Emacs
+ [[file:../modules/ui/hl-todo/README.org][hl-todo]] - TODO
+ [[file:../modules/ui/hydra/README.org][hydra]] - TODO
+ indent-guides - TODO
+ [[file:../modules/ui/ligatures/README.org][ligatures]] =+extra +fira +hasklig +iosevka +pragmata-pro= - Ligature support for Emacs
+ [[file:../modules/ui/minimap/README.org][minimap]] - TODO
+ [[file:../modules/ui/modeline/README.org][modeline]] =+light= - TODO
+ [[file:../modules/ui/nav-flash/README.org][nav-flash]] - TODO
+ [[file:../modules/ui/neotree/README.org][neotree]] - TODO
+ [[file:../modules/ui/ophints/README.org][ophints]] - TODO
+ [[file:../modules/ui/popup/README.org][popup]] =+all +defaults= - Makes temporary/disposable windows less intrusive
+ [[file:../modules/ui/tabs/README.org][tabs]] - TODO
+ [[file:../modules/ui/treemacs/README.org][treemacs]] - =+lsp= - A tree layout file explorer for Emacs
+ [[file:../modules/ui/unicode/README.org][unicode]] - TODO
+ vc-gutter - TODO
+ vi-tilde-fringe - TODO
+ [[file:../modules/ui/window-select/README.org][window-select]] =+switch-window +numbers= - TODO
+ [[file:../modules/ui/workspaces/README.org][workspaces]] - Isolated workspaces
+ [[file:../modules/ui/zen/README.org][zen]] - Distraction-free coding (or writing)

#+begin_src emacs-lisp :tangle ./init.el
       :ui
       deft              ; notational velocity for Emacs

       doom              ; what makes DOOM look the way it does

       doom-dashboard    ; a nifty splash screen for Emacs

       ;; doom-quit       ; DOOM quit-message prompts when you quit Emacs

       (emoji            ; 🙂
       ;; +ascii
       ;; +github
        +unicode
       )

       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW

       hydra

       indent-guides     ; highlighted indent columns

       (ligatures         ; ligatures and symbols to make your code pretty again
       ;; +extra
       ;; +fira
       ;; +hasklig
       ;; +iosevka
       ;; +pragmata-pro
        )

       minimap           ; show a map of the code on the side

       (modeline          ; snazzy, Atom-inspired modeline, plus API
       ;; +light
        )

       ;;nav-flash         ; blink cursor line after big motions

       ;;neotree           ; a project drawer, like NERDTree for vim

       ophints           ; highlight the region an operation acts on

       (popup            ; tame sudden yet inevitable temporary windows
        +defaults
        +all
        )

       tabs              ; a tab bar for Emacs

       (treemacs          ; a project drawer, like neotree but cooler
        +lsp
        )

       unicode           ; extended unicode support for various languages

       vc-gutter         ; vcs diff in the fringe

       vi-tilde-fringe   ; fringe tildes to mark beyond EOB

       (window-select     ; visually switch windows
        +numbers
        )

       workspaces        ; tab emulation, persistence & separate workspaces

       ;;zen               ; distraction-free coding or writing
#+end_src
*** Editor
Modules that affect and augment your ability to manipulate or insert text.

+ [[file:../modules/editor/evil/README.org][evil]] =+everywhere= - transforms Emacs into Vim
+ [[file:../modules/editor/file-templates/README.org][file-templates]] - Auto-inserted templates in blank new files
+ [[file:../modules/editor/fold/README.org][fold]] - universal code folding
+ format =+onsave= - TODO
+ god - TODO
+ [[file:../modules/editor/lispy/README.org][lispy]] - TODO
+ multiple-cursors - TODO
+ [[file:../modules/editor/objed/README.org][objed]] =+manual= - TODO
+ [[file:../modules/editor/parinfer/README.org][parinfer]] - TODO
+ rotate-text - TODO
+ [[file:../modules/editor/snippets/README.org][snippets]] - Snippet expansion for lazy typists
+ [[file:../modules/editor/word-wrap/README.org][word-wrap]] - soft wrapping with language-aware indent

#+begin_src emacs-lisp :tangle ./init.el
       :editor

       (evil               ; come to the dark side, we have cookies
        +everywhere
        )

       file-templates    ; auto-snippets for empty files

       fold                ; (nigh) universal code folding

       ;;(format             ; automated prettiness
       ;; +onsave
       ;; )

       ;;god               ; run Emacs commands without modifier keys

       ;;lispy             ; vim for lisp, for people who don't like vim

       ;;multiple-cursors  ; editing in many places at once

       ;;(objed             ; text object editing for the innocent
       ;; +manual
       ;; )

       ;;parinfer          ; turn lisp into python, sort of

       ;;rotate-text       ; cycle region at point between text candidates

       snippets          ; my elves. They type so I don't have to

       ;;word-wrap         ; soft wrapping with language-aware indent

#+end_src
*** emacs
Modules that reconfigure or augment packages or features built into Emacs.

+ [[file:../modules/emacs/dired/README.org][dired]] =+ranger +icons= - TODO
+ electric - TODO
+ [[file:../modules/emacs/ibuffer/README.org][ibuffer]] =+icons= - TODO
+ [[file:../modules/emacs/undo/README.org][undo]] =+tree= - A smarter, more intuitive & persistent undo history
+ [[file:../modules/emacs/vc/README.org][vc]] - TODO

#+begin_src emacs-lisp :tangle ./init.el
       :emacs

       (dired             ; making dired pretty [functional]
        +ranger
        +icons
        )

       electric          ; smarter, keyword-based electric-indent

       (ibuffer          ; interactive buffer management
        +icons
        )

       (undo             ; persistent, smarter undo for your inevitable mistakes
        +tree
        )

       vc                ; version-control and Emacs, sitting in a tree

#+end_src

*** term
Modules that offer terminal emulation.

+ [[file:../modules/term/eshell/README.org][eshell]] - TODO
+ shell - TODO
+ term - TODO
+ [[file:../modules/term/vterm/README.org][vterm]] - TODO

#+begin_src emacs-lisp :tangle ./init.el
       :term
       ;;eshell            ; the elisp shell that works everywhere
       ;;shell             ; simple shell REPL for Emacs
       ;;term              ; basic terminal emulator for Emacs
       ;;vterm             ; the best terminal emulation in Emacs
#+end_src
