init.el


;;; init.el -*- lexical-binding: t; -*-
(doom!

       :input

       :completion

       (company           ; the ultimate code completion backend
       ;; +childframe
       ;; +tng
        )

       (vertico           ; the search engine of the future
        +icons
        )

       :ui

       doom              ; what makes DOOM look the way it does

       doom-dashboard    ; a nifty splash screen for Emacs

       ;;doom-quit       ; DOOM quit-message prompts when you quit Emacs

       (emoji            ; 🙂
       ;; +ascii
       ;; +github
        +unicode
       )

       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW

      ;; hydra

       (modeline          ; snazzy, Atom-inspired modeline, plus API
       ;; +light
        )

       unicode           ; extended unicode support for various languages

       vc-gutter         ; vcs diff in the fringe

       (window-select     ; visually switch windows
        +numbers
        )

       zen               ; distraction-free coding or writing

       :editor

       (evil               ; come to the dark side, we have cookies
        +everywhere
        )

       snippets          ; my elves. They type so I don't have to

       :emacs

       (dired             ; making dired pretty [functional]
        +ranger
        +icons
        )

       (ibuffer          ; interactive buffer management
        +icons
        )

      ;; (undo             ; persistent, smarter undo for your inevitable mistakes
      ;;  +tree
      ;;  )

       vc                ; version-control and Emacs, sitting in a tree

       :term

       :checkers
