README.org
*** checkers
+ syntax =+childframe= - Live error/warning highlights
+ [[file:../modules/checkers/spell/README.org][spell]] =+aspell +flyspell +enchant +everywhere +hunspell= - Spell checking
+ [[file:../modules/checkers/grammar/README.org][grammar]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       :checkers
       ;; (syntax              ; tasing you for every semicolon you forget
       ;; +childframe
       ;; )

       ;; (spell              ; tasing you for misspelling mispelling
       ;; +flyspell
       ;; )

       ;; grammar             ; tasing grammar mistake every you make
#+end_src
*** tools
Small modules that give Emacs access to external tools & services.

+ ansible - TODO
+ debugger =+lsp= - A (nigh-)universal debugger in Emacs
+ [[file:../modules/tools/direnv/README.org][direnv]] - TODO
+ [[file:../modules/tools/docker/README.org][docker]] =+lsp= - TODO
+ [[file:../modules/tools/editorconfig/README.org][editorconfig]] - TODO
+ [[file:../modules/tools/ein/README.org][ein]] - TODO
+ [[file:../modules/tools/eval/README.org][eval]] =+overlay= - REPL & code evaluation support for a variety of languages
+ gist - TODO
+ [[file:../modules/tools/lookup/README.org][lookup]] =+dictionary +docsets +offline= - Universal jump-to & documentation lookup backend
+ [[file:../modules/tools/lsp/README.org][lsp]] =+peek +eglot= - Installation and configuration of language server protocol client (lsp-mode or eglot)
+ [[file:../modules/tools/magit/README.org][magit]] =+forge= - TODO
+ make - TODO
+ [[file:../modules/tools/pass/README.org][pass]] =+auth= - TODO
+ [[file:../modules/tools/pdf/README.org][pdf]] - TODO
+ prodigy - TODO
+ [[file:../modules/tools/rgb/README.org][rgb]] - TODO
+ [[file:../modules/tools/taskrunner/README.org][taskrunner]] - TODO
+ [[file:../modules/tools/terraform/README.org][terraform]] - TODO
+ tmux - TODO
+ [[file:../modules/tools/upload/README.org][upload]] - TODO

#+begin_src emacs-lisp :tangle ./init.el
       :tools
       ;;ansible

       ;;biblio            ; Writes a PhD for you (citation needed)

       ;; (debugger          ; FIXME stepping through code, to help you add bugs
       ;; +lsp
       ;; )

       ;;direnv

       ;; (docker
       ;; +lsp
       ;; )

       ;;editorconfig      ; let someone else argue about tabs vs spaces

       ;;ein               ; tame Jupyter notebooks with emacs

       (eval      ; run code, run (also, repls)
        +overlay
        )

       ;;gist              ; interacting with github gists

       (lookup              ; navigate your code and its documentation
       ;; +dictionary
       ;; +docsets
       ;; +offline
        )   ; Universal jump-to & documentation lookup

       (lsp
        +peek          ; M-x vscode
        +eglot
        )        ; Installation and configuration of language server protocol client (lsp-mode or eglot)

       (magit             ; a git porcelain for Emacs
        +forge
        )

       ;;make              ; run make tasks from Emacs

       ;; (pass              ; password manager for nerds
       ;; +auth
       ;; )

       pdf               ; pdf enhancements

       ;;prodigy           ; FIXME managing external services & code builders

       rgb               ; creating color strings

       ;;taskrunner        ; taskrunner for all your projects

       ;;terraform         ; infrastructure as code

       ;;tmux              ; an API for interacting with tmux

       ;;upload            ; map local to remote projects via ssh/ftp

#+end_src
*** os
Modules to improve integration into your OS, system, or devices.

+ [[file:../modules/os/macos/README.org][macos]] - Improve Emacs' compatibility with macOS
+ [[file:../modules/os/tty/README.org][tty]] =+osc= - Improves the terminal Emacs experience.

#+begin_src emacs-lisp :tangle ./init.el
       :os

       (:if IS-MAC macos)  ; improve compatibility with macOS

       ;; (tty               ; improve the terminal Emacs experience
       ;; +osc
       ;; )

#+end_src
*** lang
Modules that bring support for a language or group of languages to Emacs.
**** languages start
#+begin_src emacs-lisp :tangle ./init.el
       :lang
#+end_src
**** NO Agda
+ [[file:../modules/lang/agda/README.org][agda]] =+local= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;agda              ; types of types of types of types...
#+end_src
**** NO Beancount
+ [[file:../modules/lang/beancount/README.org][beancount]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;beancount         ; mind the GAAP
#+end_src
**** yes C/C++
+ [[file:../modules/lang/cc/README.org][cc]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       (cc                ; C > C++ == 1
        +lsp
        )
#+end_src
**** NO Clojure
+ [[file:../modules/lang/clojure/README.org][clojure]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;clojure           ; java with a lisp
#+end_src
**** NO common-lisp
+ common-lisp - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;common-lisp       ; if you've seen one lisp, you've seen them all
#+end_src
**** NO coq
+ [[file:../modules/lang/coq/README.org][coq]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;coq               ; proofs-as-programs
#+end_src
**** NO crystal
+ [[file:../modules/lang/crystal/README.org][crystal]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;crystal           ; ruby at the speed of c
#+end_src
**** NO C#
+ [[file:../modules/lang/csharp/README.org][csharp]] =+lsp +unity= - TODO
#+begin_src emacs-lisp :tangle ./init.el
        ;; (csharp            ; unity, .NET, and mono shenanigans
        ;; +lsp
        ;; +unity
        ;; )
#+end_src
**** NO dart / flutter
+ [[file:../modules/lang/dart/README.org][dart]] =+lsp +flutter=
#+begin_src emacs-lisp :tangle ./init.el
       ;;(dart              ; paint ui and not much else
       ;; +lsp
       ;; +flutter
       ;; )
#+end_src
**** yes data
+ data - TODO
#+begin_src emacs-lisp :tangle ./init.el
       data              ; config/data formats
#+end_src
**** NO elixir
+ [[file:../modules/lang/elixir/README.org][elixir]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;elixir            ; erlang done right
#+end_src
**** NO dhall
WTF is this?

#+begin_src emacs-lisp :tangle ./init.el
       ;;dhall
#+end_src
**** NO elm
+ elm =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;elm               ; care for a cup of TEA?
#+end_src
**** yes emacs-lisp
+ [[file:../modules/lang/emacs-lisp/README.org][emacs-lisp]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       emacs-lisp        ; drown in parentheses
#+end_src
**** NO erlang
+ [[file:../modules/lang/erlang/README.org][erlang]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;erlang            ; an elegant language for a more civilized age
#+end_src
**** NO ess
+ [[file:../modules/lang/ess/README.org][ess]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;ess               ; emacs speaks statistics
#+end_src
**** NO factor
+ [[file:../modules/lang/factor/README.org][factor]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;factor
#+end_src
**** NO faust
+ [[file:../modules/lang/faust/README.org][faust]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;faust             ; dsp, but you get to keep your soul
#+end_src
**** NO fortran
#+begin_src emacs-lisp :tangle ./init.el
       ;;fortran           ; in FORTRAN, GOD is REAL (unless declared INTEGER)
#+end_src
**** NO F#
+ [[file:../modules/lang/fsharp/README.org][fsharp]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
      ;; (fsharp            ; ML stands for Microsoft's Language
      ;;  +lsp
      ;; )
#+end_src
**** NO F*
+ [[file:../modules/lang/fstar/README.org][fstar]] - F* support
#+begin_src emacs-lisp :tangle ./init.el
       ;;fstar             ; (dependent) types and (monadic) effects and Z3
#+end_src
**** yes gdscript
+ [[file:../modules/lang/gdscript/README.org][gdscript]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       (gdscript          ; the language you waited for
        +lsp
       )
#+end_src
**** NO go
+ [[file:../modules/lang/go/README.org][go]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;(go          ; the hipster dialect
       ;; +lsp
       ;; )
#+end_src
**** NO haskell
+ [[file:../modules/lang/haskell/README.org][haskell]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;; (haskell     ; a language that's lazier than I am
       ;; +lsp
       ;; )
#+end_src
**** NO hy
+ hy - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;hy                ; readability of scheme w/ speed of python
#+end_src
**** NO idris
+ [[file:../modules/lang/idris/README.org][idris]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;idris             ; a language you can depend on
#+end_src
**** NO java
+ java =+meghanada +eclim +lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;; (java           ; the poster child for carpal tunnel syndrome
       ;; +meghanada
       ;; )
#+end_src
**** yes javascript
+ [[file:../modules/lang/javascript/README.org][javascript]] =+lsp= - JavaScript, TypeScript, and CoffeeScript support
#+begin_src emacs-lisp :tangle ./init.el
       (javascript        ; all(hope(abandon(ye(who(enter(here))))))
        +slp
        )
#+end_src
**** yes json
+ [[file:../modules/lang/json/README.org][json]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       (json              ; At least it ain't XML
        +lsp
        )
#+end_src
**** NO julia
+ [[file:../modules/lang/julia/README.org][julia]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;julia             ; a better, faster MATLAB
#+end_src
**** NO kotlin
+ [[file:../modules/lang/kotlin/README.org][kotlin]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;kotlin            ; a better, slicker Java(Script)
#+end_src
**** yes latex
+ [[file:../modules/lang/latex/README.org][latex]] =+latexmk +cdlatex +fold +lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       latex             ; writing papers in Emacs has never been so fun
#+end_src
**** NO lean
+ lean - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;lean              ; for folks with too much to prove
#+end_src
**** NO ledger
+ [[file:../modules/lang/ledger/README.org][ledger]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;ledger            ; be audit you can be
#+end_src
**** NO lua
+ [[file:../modules/lang/lua/README.org][lua]] =+fennel +moonscript= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;lua               ; one-based indices? one-based indices
#+end_src
**** yes markdown
+ [[file:../modules/lang/markdown/README.org][markdown]] =+grip= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       markdown          ; writing docs for people to ignore
#+end_src
**** NO nim
+ [[file:../modules/lang/nim/README.org][nim]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;nim               ; python + lisp at the speed of c
#+end_src
**** NO nix
+ [[file:../modules/lang/nix/README.org][nix]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;nix               ; I hereby declare "nix geht mehr!"
#+end_src
**** NO ocaml
+ [[file:../modules/lang/ocaml/README.org][ocaml]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;ocaml             ; an objective camel
#+end_src
**** yes org
+ [[file:../modules/lang/org/README.org][org]] =+brain +dragndrop +gnuplot +hugo +ipython +journal +jupyter +noter +pandoc +pomodoro +present +pretty +roam= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       (org              ; organize your plain life in plain text
        +roam
        +dragndrop
       ;; +ipython
        +journal
        +noter
       ;; +pandoc
       ;; +pomodoro
        +present
        +pretty
        )
#+end_src
**** NO php
+ [[file:../modules/lang/php/README.org][php]] =+hack +lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;php               ; perl's insecure younger brother
#+end_src
**** NO plantuml
+ plantuml - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;plantuml          ; diagrams for confusing people more
#+end_src
**** NO purescript
+ purescript =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;purescript        ; javascript, but functional
#+end_src
**** yes python
+ [[file:../modules/lang/python/README.org][python]] =+cython +lsp +pyright +pyenv +conda +poetry= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       (python            ; beautiful is better than ugly
        +lsp
        )
#+end_src
**** NO qt
+ qt - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;qt                ; the 'cutest' gui framework ever
#+end_src
**** NO racket
+ [[file:../modules/lang/racket/README.org][racket]] =+lsp +xp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;racket            ; a DSL for DSLs
#+end_src
**** NO raku
+ [[file:../modules/lang/raku/README.org][raku]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;raku              ; the artist formerly known as perl6
#+end_src
**** NO rest (emacs REST client)
+ [[file:../modules/lang/rest/README.org][rest]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;rest              ; Emacs as a REST client
#+end_src
**** NO rst
+ rst - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;; rst               ; ReST in peace
#+end_src
**** NO ruby
+ [[file:../modules/lang/ruby/README.org][ruby]] =+lsp +rvm +rbenv +rails +chruby=
#+begin_src emacs-lisp :tangle ./init.el
       ;; (ruby      ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
       ;; +rails
       ;; )
#+end_src
**** NO rust
+ [[file:../modules/lang/rust/README.org][rust]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
      ;; (rust              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
      ;;  +lsp
      ;;  )
#+end_src
**** NO scala
+ [[file:../modules/lang/scala/README.org][scala]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;scala             ; java, but good
#+end_src
**** NO scheme
+ [[file:../modules/lang/scheme/README.org][scheme]] =+chez +chibi +chicken +gambit +gauche +guile +kawa +mit +racket= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;; (scheme    ; a fully conniving family of lisps
       ;; +chez
       ;; +chibi
       ;; +chicken
       ;; +gambit
       ;; +gauche
       ;; +guile
       ;; +kawa
       ;; +mit
       ;; +racket
       ;; )
#+end_src
