init.el

       grammar             ; tasing grammar mistake every you make

       :tools

       (lsp
        +peek          ; M-x vscode
       ;; +eglot
        )

       (magit             ; a git porcelain for Emacs
        +forge
        )

       pdf               ; pdf enhancements

       rgb               ; creating color strings

       :lang

       data              ; config/data formats

       emacs-lisp        ; drown in parentheses

       (gdscript          ; the language you waited for
        +lsp
       )

       (javascript        ; all(hope(abandon(ye(who(enter(here))))))
        +slp
        )

       (json              ; At least it ain't XML
        +lsp
        )

       latex             ; writing papers in Emacs has never been so fun

       ledger            ; be audit you can be

       markdown          ; writing docs for people to ignore

       (org              ; organize your plain life in plain text
       ;; +brain
        +dragndrop
       ;; +gnuplot
       ;; +hugo
       ;; +ipython
        +journal
       ;; +jupyter
        +noter
       ;; +pandoc
        +pomodoro
        +present
        +pretty
        +roam2
        )

       (python            ; beautiful is better than ugly
        +lsp
        )
