README.org
**** NO sh
+ [[file:../modules/lang/sh/README.org][sh]] =+fish +lsp +powershell= - TODO
#+begin_src emacs-lisp :tangle ./init.el
      ;; (sh                ; she sells {ba,z,fi}sh shells on the C xor
      ;;  +lsp
      ;;  +fish
      ;; )
#+end_src
**** NO sml
+ [[file:../modules/lang/sml/README.org][sml]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;sml
#+end_src
**** NO solidity
+ [[file:../modules/lang/solidity/README.org][solidity]] - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;solidity          ; do you need a blockchain? No.
#+end_src
**** NO swift
+ swift =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;swift             ; who asked for emoji variables?
#+end_src
**** NO terra
+ terra - TODO
#+begin_src emacs-lisp :tangle ./init.el
       ;;terra             ; Earth and Moon in alignment for performance.
#+end_src
**** yes web (html / css)
+ web =+lsp= - HTML and CSS (SCSS/SASS/LESS/Stylus) support.
#+begin_src emacs-lisp :tangle ./init.el
       (web               ; HTML and CSS (SCSS/SASS/LESS/Stylus) support.
        +lsp
        )
#+end_src
**** NO yaml
+ [[file:../modules/lang/yaml/README.org][yaml]] =+lsp= - TODO
#+begin_src emacs-lisp :tangle ./init.el
      ;; (yaml              ; JSON, but readable
      ;;  +lsp
      ;;  )
#+end_src
**** NO zig
+ [[file:../modules/lang/zig/README.org][zig]] =+lsp= - Zig support.
#+begin_src emacs-lisp :tangle ./init.el
       ;;zig               ; C, but simpler
#+end_src
*** email
+ [[file:../modules/email/mu4e/README.org][mu4e]] =+org +gmail= - TODO
+ [[file:../modules/email/notmuch/README.org][notmuch]] - TODO
+ wanderlust =+gmail= - TODO

#+begin_src emacs-lisp :tangle ./init.el
       :email
       ;; (mu4e
       ;; +org
       ;; +gmail
       ;; )

       ;;notmuch
       ;; (wanderlust
       ;; +gmail
       ;; )
#+end_src
*** app
Application modules are complex and opinionated modules that transform Emacs
toward a specific purpose. They may have additional dependencies and *should be
loaded last*, before =:config= modules.

+ [[file:../modules/app/calendar/README.org][calendar]] - TODO
+ [[file:../modules/app/emms/README.org][emms]] - TODO
+ [[file:../modules/app/everywhere/README.org][everywhere]] - TODO
+ [[file:../modules/app/irc/README.org][irc]] - how neckbeards socialize
+ [[file:../modules/app/rss/README.org][rss]] =+org= - an RSS client in Emacs
+ [[file:../modules/app/twitter/README.org][twitter]] - A twitter client for Emacs

#+begin_src emacs-lisp :tangle ./init.el
       :app
       calendar
       ;;emms
       ;;everywhere        ; *leave* Emacs!? You must be joking
       ;;irc               ; how neckbeards socialize

       ;; (rss         ; emacs as an RSS reader
       ;; +org
       ;; )

       ;;twitter           ; twitter client https://twitter.com/vnought

#+end_src
*** config
Modules that configure Emacs one way or another, or focus on making it easier
for you to customize it yourself. It is best to load these last.

+ [[file:../modules/config/literate/README.org][literate]] - For users with literate configs. This will tangle+compile a
  config.org in your ~doom-private-dir~ when it changes.
+ [[file:../modules/config/default/README.org][default]] =+bindings +smartparens= - The default module sets reasonable defaults
  for Emacs. It also provides a Spacemacs-inspired keybinding scheme and a
  smartparens config. Use it as a reference for your own modules.

#+begin_src emacs-lisp :tangle ./init.el
       :config
       ;;literate
       (default
        +bindings
        +smartparens
        )
#+end_src

*** benchmark startup time
#+begin_src emacs-lisp :tangle no
;;(when doom-debug-p
;;  (require 'benchmark-init)
;;  (add-hook 'doom-first-input-hook #'benchmark-init/deactivate))
#+end_src
*** doom block end
#+begin_src emacs-lisp :tangle ./init.el
)
#+end_src
** config.el
#+begin_src emacs-lisp :tangle ./config.el

#+end_src
*** _
Place your private configuration here! Remember, you do not need to run =doom
sync= after modifying this file!

#+begin_src emacs-lisp :tangle ./config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src
*** Info
**** _
Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets.

#+begin_src emacs-lisp :tangle ./config.el
;; Personal information
(setq
      user-full-name "João Luís Teixeira Pinto"
      user-mail-address "jolitp@gmail.com"
)
#+end_src

**** Additional functions/macros
Here are some additional functions/macros that could help you configure Doom:

- =load!= for loading external *.el files relative to this one

- =use-package!= for configuring packages

- =after!= for running code after a package has loaded

- =add-load-path!= for adding directories to the =load-path=, relative to this
  file. Emacs searches the =load-path= when you load packages with =require= or
  =use-package=.

- =map!= for binding new keys

To get information about any of these functions/macros, move the cursor over the
highlighted symbol at press =K= (non-evil users must press =C-c c k=). This will
open documentation for it, including demos of how they are used.

You can also try =gd= (or =C-c c d=) to jump to their definition and see how
they are implemented.
*** Looks
**** Fonts

Doom exposes five (optional) variables for controlling fonts in Doom.

Here are the three important ones:

+ `doom-font'
+ `doom-variable-pitch-font'
+ `doom-big-font' -- used for `doom-big-font-mode'; use this for
  presentations or streaming.

They all accept either a font-spec, font string ("Input Mono-12"), or xlfd font
string. You generally only need these two:

#+begin_src emacs-lisp :tangle ./config.el
(setq doom-font (font-spec :family "Source Code Pro"
                           :size 32
                           :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "sans"
                                          :size 32))
#+end_src

**** Theme

There are two ways to load a theme. Both assume the theme is installed and
available. You can either set `doom-theme' or manually load a theme with the
`load-theme' function. This is the default:

#+begin_src emacs-lisp :tangle ./config.el
(setq doom-theme 'doom-one)
#+end_src

**** Line Numbers

This determines the style of line numbers in effect. If set to `nil', line
numbers are disabled. For relative line numbers, set this to `relative'.

#+begin_src emacs-lisp :tangle ./config.el
(setq display-line-numbers-type 'relative)
#+end_src

*** Fixes
**** Remove exit confirmation message
Removes annoying exit confirmation message

#+begin_src emacs-lisp :tangle ./config.el
(setq confirm-kill-emacs nil)
#+end_src
*** Org
**** org files location

If you use `org' and don't want your org files in the default location below,
change `org-directory'. It must be set before org loads!

#+begin_src emacs-lisp :tangle ./config.el
(setq org-directory "~/Dropbox/org/")
#+end_src

**** roam
adds the location of the org-roam folder

#+begin_src emacs-lisp :tangle ./config.el
(setq org-roam-directory "~/Dropbox/org/roam")
(setq org-roam-dailies-directory "~/Dropbox/org/roam/daily")
#+end_src
*** Keybindings
** packages.el
#+begin_src emacs-lisp :tangle ./packages.el

#+end_src
*** Example usage
**** _
To install a package with Doom you must declare them here and *run =doom sync=
on the command line*, then restart Emacs for the changes to take effect -- or
use =M-x doom/reload=.

#+begin_src emacs-lisp :tangle ./packages.el

;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+end_src

**** packages from MELPA, ELPA or emacsmirror

To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:

#+begin_src emacs-lisp :tangle ./packages.el
;(package! some-package)
#+end_src

**** package from git

To install a package directly from a remote git repo, you must specify a
`:recipe'. You'll find documentation on what `:recipe' accepts here:
https://github.com/raxod502/straight.el#the-recipe-format

#+begin_src emacs-lisp :tangle ./packages.el
;(package! another-package
;  :recipe (:host github :repo "username/repo"))
#+end_src

**** package without PACKAGENAME.el, or in subdirecotry of the repo

If the package you are trying to install does not contain a PACKAGENAME.el
file, or is located in a subdirectory of the repo, you'll need to specify
`:files' in the `:recipe':

#+begin_src emacs-lisp :tangle ./packages.el
;(package! this-package
;  :recipe (:host github :repo "username/repo"
;           :files ("some-file.el" "src/lisp/*.el")))
#+end_src

**** disable a package included with Doom

If you'd like to disable a package included with Doom, you can do so here
with the `:disable' property:

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :disable t)
#+end_src

**** overriding the recipe of a built in package

You can override the recipe of a built in package without having to specify
all the properties for `:recipe'. These will inherit the rest of its recipe
from Doom or MELPA/ELPA/Emacsmirror:

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :recipe (:nonrecursive t))
;(package! builtin-package-2 :recipe (:repo "myfork/package"))
#+end_src

**** package from a particular branch or tag

Specify a `:branch' to install a package from a particular branch or tag.
This is required for some packages whose default branch isn't 'master' (which
our package manager can't deal with; see raxod502/straight.el#279)

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :recipe (:branch "develop"))
#+end_src

**** specify a particular commit
Use `:pin' to specify a particular commit to install.

#+begin_src emacs-lisp :tangle ./packages.el
;(package! builtin-package :pin "1a2b3c4d5e")
#+end_src

**** unpin (Doom) packages
***** single package

Doom's packages are pinned to a specific commit and updated from release to
release. The `unpin!' macro allows you to unpin single packages...

#+begin_src emacs-lisp :tangle ./packages.el
;(unpin! pinned-package)
#+end_src

***** single package

...or multiple packages

#+begin_src emacs-lisp :tangle ./packages.el
;(unpin! pinned-package another-pinned-package)
#+end_src

***** all packages

...Or *all* packages (NOT RECOMMENDED; will likely break things)

#+begin_src emacs-lisp :tangle ./packages.el
;(unpin! t)
#+end_src

*** benchmark startup time

#+begin_src emacs-lisp :tangle ./packages.el
;;(package! benchmark-init)
#+end_src

* Notes about configuring Doom Emacs
** _
You can configure Doom by tweaking the files found in your =DOOMDIR=. Doom
expects this directory to be found in one of:

=~/.config/doom= (respects =$XDG_CONFIG_HOME)= or =~/.doom.d= This directory is
referred to as your =DOOMDIR=. Only one of these directories should exist (Doom
will only recognize one).

Change the =DOOMDIR= environment variable to change where Doom looks for this
directory. Symlinks will work as well.

When you ran =doom install=, it deployed a simple Doom configuration to your
=DOOMDIR=, comprised of these three files:
** init.el
Where you’ll find your =doom!= block, which controls what Doom modules are
enabled and in what order they will be loaded.

This file is evaluated early when Emacs is starting up; before any other module
has loaded. You generally shouldn’t add code to this file unless you’re
targeting Doom’s CLI or something that needs to be configured very early in the
startup process.
** config.el
Here is where 99.99% of your private configuration should go. Anything in here
is evaluated after all other modules have loaded, when starting up Emacs.
** packages.el
Package management is done from this file; where you’ll declare what packages to
install and where from.
*** Note:
do not use =M-x customize= or the customize API in general. Doom is designed to
be configured programmatically from your config.el, which can conflict with
Customize’s way of modifying variables.

If you’re concerned about =defcustom= setters, Doom has a =setq!= macro that
will trigger them.
** the doom binary CLI utility
This utility is your new best friend. It won’t spot you a beer, but it’ll
shoulder much of the work associated with managing and maintaining your Doom
Emacs configuration, and then some. Not least of which is installation of and
updating Doom and your installed packages.

It exposes a variety of commands. =bin/doom= help will list them all, but here
is a summary of the most important ones:

- =doom sync=: This synchronizes your config with Doom Emacs. It ensures that
  needed packages are installed, orphaned packages are removed and necessary
  metadata correctly generated. Run this whenever you modify your =doom!= block
  or =packages.el= file. You’ll need =doom sync -u= if you override the recipe
  of package installed by another module.

- =doom upgrade=: Updates Doom Emacs (if available) and all its packages.

- =doom env=: (Re)generates an “envvar file”, which is a snapshot of your shell
  environment that Doom loads at startup. If your app launcher or OS launches
  Emacs in the wrong environment you will need this. **This is required for GUI
  Emacs users on MacOS.**

- =doom doctor=: If Doom misbehaves, the doc will diagnose common issues with
  your installation, system and environment.

- =doom purge=: Over time, the repositories for Doom’s plugins will accumulate.
  Run this command from time to time to delete old, orphaned packages, and with
  the =-g= switch to compact existing package repos.

Use =doom help= to see an overview of the available commands that =doom=
provides, and =doom help COMMAND= to display documentation for a particular
=COMMAND=.

I recommend you add =~/.emacs.d/bin= to your =PATH= so you can call =doom=
directly and from anywhere. Accomplish this by adding this to your .bashrc or
.zshrc file: ~export PATH=”$HOME/.emacs.d/bin:$PATH”~
