init.el

       (web               ; HTML and CSS (SCSS/SASS/LESS/Stylus) support.
        +lsp
        )

       :app

       calendar

       :config
       ;;literate
       (default
        +bindings
        +smartparens
        )

)
